РП/src/InformationRegisters/НастройкаПередачиМатериаловВПроизводство/НастройкаПередачиМатериаловВПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаПередачиМатериаловВПроизводство</name>
  <resources>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <resources>
    <name>ОснованиеДляПолучения</name>
    <type>
      <types>EnumRef.ОснованияДляПолученияМатериаловВПроизводстве</types>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

РП/src/Enums/ОснованияДляПолученияМатериаловВПроизводстве/ОснованияДляПолученияМатериаловВПроизводстве.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОснованияДляПолученияМатериаловВПроизводстве</name>
  <enumValues>
    <name>ПоЗаказуНаПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПоЗаказуНаВнутреннееПотребление</name>
  </enumValues>
</mdclass:Enum>

РП/src/InformationRegisters/НастройкаПередачиМатериаловВПроизводство/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Установим получение материала по заказу на производство
	// для настроек в которых не заполнена номенклатура
	Для каждого Запись Из ЭтотОбъект Цикл
		
		ТребуетсяПередачаПоЗаказуНаПроизводство = Ложь;
		
		Если НЕ ЗначениеЗаполнено(Запись.Номенклатура) Тогда
			
			//++ НЕ УТКА
			Запись.ОснованиеДляПолучения = Перечисления.ОснованияДляПолученияМатериаловВПроизводстве.ПоЗаказуНаПроизводство;
			//-- НЕ УТКА
			ТребуетсяПередачаПоЗаказуНаПроизводство = Истина;
			
		КонецЕсли;
		
		Если ТребуетсяПередачаПоЗаказуНаПроизводство И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ОснованиеДляПолучения") Тогда
			
			ДанныеЗаполнения.Удалить("ОснованиеДляПолучения");
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
